Resources/fixtures/trading/payment/payment.yaml

payment_number: 5046323112
collector:
    id: 254289619
currency_id: BRL
status: approved
status_code: ''
status_detail: accredited
transaction_amount: 243.9
transaction_net_amount: 204.88
shipping_cost: 0
overpaid_amount: 0
total_paid_amount: 243.9
marketplace_fee: 39.02
coupon_amount: 0
date_created: '2016-12-09T09:47:39.000-04:00'
date_last_modified: '2016-12-12T06:46:29.000-04:00'
card_id: ''
reason: ''
activation_uri: ''
payment_method_id: bolacme
installments: 1
issuer_id: 0
atm_transfer_reference:
    company_id: 0
    transaction_id: 0
coupon_id: ''
operation_type: regular_payment
payment_type: ticket
available_actions: {  }
installment_amount: 0
deferred_period: ''
date_approved: '2016-12-12T06:46:29.000-04:00'
authorization_code: ''
transaction_order_id: '6485856515'
tags: {  }
expands:
    id: 5046323112
    date_created: '2016-12-09T09:47:39.000-04:00'
    date_approved: '2016-12-12T06:46:29.000-04:00'
    date_last_updated: '2016-12-12T06:46:29.000-04:00'
    date_of_expiration: null
    money_release_date: '2017-01-02T06:46:29.000-04:00'
    operation_type: regular_payment
    issuer_id: null
    payment_method_id: bolacme
    payment_type_id: ticket
    status: approved
    status_detail: accredited
    currency_id: BRL
    description: 'Kit Acme de atordoamento de Road Runners'
    live_mode: true
    sponsor_id: null
    authorization_code: null
    money_release_schema: null
    counter_currency: null
    collector_id: 254289619
    payer:
        type: registered
        id: '179119340'
        identification:
            type: CPF
            number: 59817473074
        email: null
        phone:
            area_code: ' '
            number: '4199476784'
            extension: null
        first_name: Wile
        last_name: 'E. Coyote'
        entity_type: null
    metadata: {  }
    additional_info:
        items:
            - { id: MLB391639152, title: 'Kit Acme de atordoamento de Road Runners', description: null, picture_url: null, category_id: MLB114434, quantity: '1', unit_price: '243.9' }
    order:
        type: mercadolibre
        id: '6485856515'
    external_reference: '6485856515'
    transaction_amount: 243.9
    transaction_amount_refunded: 0
    coupon_amount: 0
    differential_pricing_id: null
    deduction_schema: null
    barcode:
        type: null
        width: null
        height: null
        content: '37271700633330237927371000002439033802507443'
    transaction_details:
        net_received_amount: 204.88
        total_paid_amount: 243.9
        overpaid_amount: 0
        external_resource_url: 'https://www.mercadopago.com/mlb/payments/ticket/helper?payment_id=5046323112&payment_method_reference_id=2717744337&caller_id=179119340'
        installment_amount: 243.9
        financial_institution: null
        payment_method_reference_id: '2717744337'
        payable_deferral_period: null
        acquirer_reference: null
        verification_code: '2717744337'
    fee_details:
        -
            type: ml_fee
            amount: 22.46
            fee_payer: collector
        -
            type: mp_fee
            amount: 16.56
            fee_payer: collector
    captured: true
    binary_mode: false
    call_for_authorize_id: null
    statement_descriptor: null
    installments: 1
    card: {  }
    notification_url: null
    refunds: {  }
    processing_mode: aggregator
    merchant_account_id: null
    acquirer: null
    merchant_number: null
    acquirer_reconciliation: {  }
